app/Models/masyarakat.php

INSERT INTO `masyarakat` (`nik`, `nama`, `username`, `password`, `telp`) VALUES ('1050245708900004', 'pasifik4', 'pasifik15', '$2y$10$i0lO47QAc94uVcb8ljbYsOLb6Ym.BsLOUTlA9bBm4F3fX62cWnYGm', '0812-3421-1235')
---
	function add($data) {
		return $this->db
                        ->table('masyarakat')
                        ->insert($data);